2025/Day06/Day06.org
#+TITLE: Advent of Code 2025 - Day 6: Trash Compactor
#+AUTHOR: Leo Laporte
#+DATE: Started Sat Dec 6 2025 11:15, Finished: Mon Dec  8 15:15:20 2025
#+PROPERTY: header-args:lisp :tangle Day06.lisp :comments link
#+auto_tangle: t

* Day 6: Trash Compactor

** Prologue - Setup

Standard setup for AOC solutions.

#+begin_src lisp :results silent
;;;; Day06.lisp
;;;; 2025 AOC Day 6 solution
;;;; Common Lisp solutions by Leo Laporte (with lots of help)
;;;; Started: 06 Dec 2025 at 11:15
;;;; Finished:

;; ----------------------------------------------------------------------------
;; Prologue code for setup - same every day
;; ----------------------------------------------------------------------------

(defpackage :aoc.2025.day06
            (:use :cl :alexandria :iterate)      ; no prefix for these libraries
            (:local-nicknames                    ; short prefixes for these
             (:re :cl-ppcre)                     ; regex
             (:5a :fiveam)                       ; test framework
             (:sr :serapeum)                     ; CL extensions
             (:tr :trivia)))                     ; pattern matching

(in-package :aoc.2025.day06)

(setf 5a:*run-test-when-defined* t)  ; test as we go
(setf 5a:*verbose-failures* t)       ; show failing expression
(sr:toggle-pretty-print-hash-table)  ; automatic pretty print for hashes
(declaim (optimize (debug 3)))       ; max debugging info
;; (declaim (optimize (speed 3))     ; max speed if needed

(defparameter *data-file* "~/cl/AOC/2025/Day06/input.txt"
  "Downloaded from the AoC problem set")
#+end_src

** Part One

Hmmm. Seems easy. Too easy. I've got a bad feeling about this.

I'll =PARSE-INPUT= into two values, an array of lists, each list will contain
all the integers from the columns, and then a list of operand strings. The
problem is practically done by then. I just apply each operand to its
respective column and sum the results. The list will be very long with the
provided data but I don't think 1000 digits lists are particularly
problematic. Let's see.

*** Example Data

#+begin_src lisp :results silent
(defparameter *example* (list "123 328  51 64 "
                              " 45 64  387 23 "
                              "  6 98  215 314"
                              "*   +   *   +  "))
#+end_src

*** Parser

#+begin_src lisp :results output silent
(sr:-> parse-input (list) (values array list))
(defun parse-input (input)
  "given a list of strings, return two values, an array of integers by column
and a list of strings representing operators"
  (let* ((rows (length input))
         (cols (length (sr:words (first input)))) ; actual numbers not spaces
         ;; an array of lists - each list contains all the integers from a column
         (digits (make-array cols :element-type 'list :initial-element nil)))

    (iter (for row below (1- rows))
      (for row-of-nums = (sr:words (nth row input))) ; chop it up first
      (iter (for col below cols)
        (setf (aref digits col)
              (push (parse-integer (nth col row-of-nums)) ; the number
                    (aref digits col)))))       ; that column's list

    ;; return array of lists of integers by column and list of operators
    (values digits (sr:tokens (lastcar input)))))
#+end_src

** Test Parse

Let's see how the parser works with the example...

#+name: parse-test
#+begin_src lisp :results replace
(multiple-value-bind (digits operators) (parse-input *example*)
  (format t "Digits: ~S~%Operators: ~S~%" digits operators))
#+end_src

#+RESULTS: parse-test
: Digits: #((6 45 123) (98 64 328) (215 387 51) (314 23 64))
: Operators: ("*" "+" "*" "+")

*** Solution

#+Begin_src lisp :results output silent
(sr:-> day06-1 (list) number)
(defun day06-1 (input)
  "given a list of strings of digits and a final string of operators, produce
the sum of the results of using each operator on the column above - most of the
work is done in the parsing"
  (multiple-value-bind (digits operators) (parse-input input)

    ;; now go through each column
    (iter (for col below (length digits))
      (summing
        ;; apply the apropriate operand
        (ecase (char (nth col operators) 0)
          (#\+ (apply #'+ (aref digits col)))
          (#\* (apply #'* (aref digits col))))))))
#+end_src

#+name: part-1-test
#+begin_src lisp :results replace
(5a:test day06-1-test
  (5a:is (= 4277556 (day06-1 *example*))))
#+end_src

#+RESULTS: part-1-test
:
: Running test DAY06-1-TEST .
:  Did 1 check.
:     Pass: 1 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)


