2025/Day06/Day06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-08 Mon 15:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advent of Code 2025 - Day 6: Trash Compactor</title>
<meta name="author" content="Leo Laporte" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Advent of Code 2025 - Day 6: Trash Compactor</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org60b4e1d">1. Day 6: Trash Compactor</a>
<ul>
<li><a href="#org0a78e68">1.1. Prologue - Setup</a></li>
<li><a href="#org52cf076">1.2. Part One</a>
<ul>
<li><a href="#org49ba835">1.2.1. Example Data</a></li>
<li><a href="#orgb410358">1.2.2. Parser</a></li>
</ul>
</li>
<li><a href="#orge87b863">1.3. Test Parse</a>
<ul>
<li><a href="#org358ff5b">1.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgfabf9dd">1.4. Part Two</a>
<ul>
<li><a href="#orgd16ce68">1.4.1. Cephalopod Parser</a></li>
<li><a href="#orgefcedf6">1.4.2. Solution</a></li>
</ul>
</li>
<li><a href="#org1edf5c6">1.5. Solutions</a></li>
<li><a href="#orgdaaeca4">1.6. Performance</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org60b4e1d" class="outline-2">
<h2 id="org60b4e1d"><span class="section-number-2">1.</span> Day 6: Trash Compactor</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0a78e68" class="outline-3">
<h3 id="org0a78e68"><span class="section-number-3">1.1.</span> Prologue - Setup</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Standard setup for AOC solutions.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><code>;;;; Day06.lisp
;;;; 2025 AOC Day 6 solution
;;;; Common Lisp solutions by Leo Laporte (with lots of help)
;;;; Started: 06 Dec 2025 at 11:15
;;;; Finished:

;; ----------------------------------------------------------------------------
;; Prologue code for setup - same every day
;; ----------------------------------------------------------------------------

(defpackage :aoc.2025.day06
            (:use :cl :alexandria :iterate)      ; no prefix for these libraries
            (:local-nicknames                    ; short prefixes for these
             (:re :cl-ppcre)                     ; regex
             (:5a :fiveam)                       ; test framework
             (:sr :serapeum)                     ; CL extensions
             (:tr :trivia)))                     ; pattern matching

(in-package :aoc.2025.day06)

(setf 5a:*run-test-when-defined* t)  ; test as we go
(setf 5a:*verbose-failures* t)       ; show failing expression
(sr:toggle-pretty-print-hash-table)  ; automatic pretty print for hashes
(declaim (optimize (debug 3)))       ; max debugging info
;; (declaim (optimize (speed 3))     ; max speed if needed

(defparameter *data-file* "~/cl/AOC/2025/Day06/input.txt"
  "Downloaded from the AoC problem set")
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org52cf076" class="outline-3">
<h3 id="org52cf076"><span class="section-number-3">1.2.</span> Part One</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Hmmm. Seems easy. Too easy. I&rsquo;ve got a bad feeling about this.
</p>

<p>
I&rsquo;ll <code>PARSE-INPUT</code> into two values, an array of lists, each list will contain
all the integers from the columns, and then a list of operand strings. The
problem is practically done by then. I just apply each operand to its
respective column and sum the results. The list will be very long with the
provided data but I don&rsquo;t think 1000 digits lists are particularly
problematic. Let&rsquo;s see.
</p>
</div>
<div id="outline-container-org49ba835" class="outline-4">
<h4 id="org49ba835"><span class="section-number-4">1.2.1.</span> Example Data</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-lisp"><code>(defparameter *example* (list "123 328  51 64 "
                              " 45 64  387 23 "
                              "  6 98  215 314"
                              "*   +   *   +  "))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgb410358" class="outline-4">
<h4 id="orgb410358"><span class="section-number-4">1.2.2.</span> Parser</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-lisp"><code>(sr:-&gt; parse-input (list) (values array list))
(defun parse-input (input)
  "given a list of strings, return two values, an array of integers by column
and a list of strings representing operators"
  (let* ((rows (length input))
         (cols (length (sr:words (first input)))) ; actual numbers not spaces
         ;; an array of lists - each list contains all the integers from a column
         (digits (make-array cols :element-type 'list :initial-element nil)))

    (iter (for row below (1- rows))
      (for row-of-nums = (sr:words (nth row input))) ; chop it up first
      (iter (for col below cols)
        (setf (aref digits col)
              (push (parse-integer (nth col row-of-nums)) ; the number
                    (aref digits col)))))       ; that column's list

    ;; return array of lists of integers by column and list of operators
    (values digits (sr:tokens (lastcar input)))))
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge87b863" class="outline-3">
<h3 id="orge87b863"><span class="section-number-3">1.3.</span> Test Parse</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let&rsquo;s see how the parser works with the example&hellip;
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb22bbcd"><code>(multiple-value-bind (digits operators) (parse-input *example*)
  (format t "Digits: ~S~%Operators: ~S~%" digits operators))
</code></pre>
</div>

<pre class="example">
Digits: #((6 45 123) (98 64 328) (215 387 51) (314 23 64))
Operators: ("*" "+" "*" "+")
</pre>
</div>
<div id="outline-container-org358ff5b" class="outline-4">
<h4 id="org358ff5b"><span class="section-number-4">1.3.1.</span> Solution</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-lisp"><code>(sr:-&gt; day06-1 (list) number)
(defun day06-1 (input)
  "given a list of strings of digits and a final string of operators, produce
the sum of the results of using each operator on the column above - most of the
work is done in the parsing"
  (multiple-value-bind (digits operators) (parse-input input)

    ;; now go through each column
    (iter (for col below (length digits))
      (summing
        ;; apply the apropriate operand
        (ecase (char (nth col operators) 0)
          (#\+ (apply #'+ (aref digits col)))
          (#\* (apply #'* (aref digits col))))))))
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org958e9df"><code>(5a:test day06-1-test
  (5a:is (= 4277556 (day06-1 *example*))))
</code></pre>
</div>

<pre class="example">

Running test DAY06-1-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>
</div>
</div>
</div>
