2025/Day06/Day06.html
<div id="outline-container-orgfabf9dd" class="outline-3">
<h3 id="orgfabf9dd"><span class="section-number-3">1.4.</span> Part Two</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Frickin&rsquo; cephalpods. They&rsquo;re as bad as the lanternfish. So it turns out that the
columns are digit by digit. And spaces are significant. This is going to require
a completely different parser. I think the final function can remain mostly the
same as long as the parsing is done correctly.
</p>

<p>
In fact, I can pretty much use the same parser with slight
modifications. Instead of using <code>WORDS</code> to extract the digits I&rsquo;ll step through
the string a column at a time, replacing spaces with zeroes and putting in the
single digits.
</p>

<p>
This is simple. Right? Right? Well not exactly. The integers to process are
combinations of all the digits in the column. So&hellip;
</p>

<pre class="example" id="org6cc09da">
64
23
314
+
</pre>

<p>
ends up being: 623 + 431 + 4. So I will have to chunk up the columns and then
index into them. A bit more complicated.
</p>

<p>
The real question is how can I determine when to begin a new column? Is the
width consistent? Alas no. Examining the input file shows that operands are
usually separated by four columns but not always (unlike the example - tricky!)
</p>

<p>
Is a new column always begun by an operator? Can I use them as an anchor? First,
a test to see if the operators do really match the start of the columns&hellip;
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org539d7c6"><code>(defun opstarts (input)
  (let* ((rows (1- (length input)))
         (op-string (nth rows input))
         (column-starts '()))

    ;; use op-string to determine column start and end
    (iter (for i below (length op-string))
      (when (not (char= #\space (char op-string i)))
        (push i column-starts)))        ; push column start

    (reverse column-starts)))

;; print the operator start list for *example*
(format t "Ops starts for *example*: ~a~%~%" (opstarts *example*))

;; compare the input to the operators (well just the first 70 characters)
(format t "First 70 chars of input: ~%~a~%~a~%~a~%~a~%~a~%"
        (subseq (first (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (second (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (third (uiop:read-file-lines *data-file*)) 0 70)        (subseq (fourth (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (nth 4 (uiop:read-file-lines *data-file*)) 0 70))
</code></pre>
</div>

<pre class="example">
Ops starts for *example*: (0 4 8 12)

First 70 chars of input: 
886  63  27 258 98 318 99 975  7 6393 947 87 23 765 35      1 6415 4  
652  49  14  97 72 335 28 269 23 1648 698 46 68 814 3193   89  421 13 
65  143  36   8 42 429 55 327 44  775 558 76 85 171 6136 9139   23 97 
8   686 695   9 4  689 2  373 96  131 7   41 96 28  7328 8919   66 68 
*   +   +   *   +  +   *  +   *  +    +   *  *  +   +    +    +    *  
</pre>

<p>
Yep that seems to work for the example and at least for the first 70 of 1000
characters in the input data. I think it&rsquo;s worth going forward with that assumption, so I think the easiest way to do this is to create a new parser, CEPHLAPOD-PARSE, that creates a 2D array of digits grouped by column, instead of WORDS, and I might as well keep the list of operators in the array.
</p>
</div>
