2025/Day06/Day06.lisp

;; [[file:Day06.org::operator-column-test][operator-column-test]]
(defun opstarts (input)
  (let* ((rows (1- (length input)))
         (op-string (nth rows input))
         (column-starts '()))

    ;; use op-string to determine column start and end
    (iter (for i below (length op-string))
      (when (not (char= #\space (char op-string i)))
        (push i column-starts)))        ; push column start

    (reverse column-starts)))

;; print the operator start list for *example*
(format t "Ops starts for *example*: ~a~%~%" (opstarts *example*))

;; compare the input to the operators (well just the first 70 characters)
(format t "First 70 chars of input: ~%~a~%~a~%~a~%~a~%~a~%"
        (subseq (first (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (second (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (third (uiop:read-file-lines *data-file*)) 0 70)        (subseq (fourth (uiop:read-file-lines *data-file*)) 0 70)
        (subseq (nth 4 (uiop:read-file-lines *data-file*)) 0 70))
;; operator-column-test ends here
