2025/Day06/Day06.org
*** Cephalopod Parser

#+name: cephlapod-parse
#+begin_src lisp :result replace
(sr:-> cephalapod-parse (list) array)
(defun cephalapod-parse (input)
  "given a list of strings, return a 2D array with number strings grouped by column"
  (let ((rows (length input))       ; number of lines will be rows in arr
        (column-starts '())             ; indices into line for each column
        (operators (lastcar input)))    ; the operators are the last line

    ;; use the operators to determine column starts
    (iter (for i below (length operators))
      (when (not (char= #\space (char operators i))) ; it's an operand
        (push i column-starts))) ; save the location of the operand
    (setf column-starts (reverse column-starts))

    ;; now fill the 2d array GRID with numbers by column groups
    (let ((grid (make-array (list rows (length column-starts))
                            :element-type 'list
                            :initial-element nil)))
      (iter (for line in input)
        (for row :from 0)
        (iter (for (start . rest) on column-starts)
          (for group :from 0)
          (setf (aref grid row group)
                (push (subseq line start (first rest))
                      (aref grid row group)))))
      grid)))
#+end_src

#+RESULTS: cephlapod-parse

Let's see what that produces... BTW I've changed my source template in the Emacs ORG-MODE.EL configuration to provide an automatic name for every source block using the current time. Just to keep things straight.

#+name: lisp-063930
#+begin_src lisp :results replace
(format t "Example: ~%~a" (cephalapod-parse *example*))
#+end_src

#+RESULTS: lisp-063930
: Example:
: #2A(((123 ) (328 ) ( 51 ) (64 ))
:     (( 45 ) (64  ) (387 ) (23 ))
:     ((  6 ) (98  ) (215 ) (314))
:     ((*   ) (+   ) (*   ) (+  )))

I see I am capturing the space at the end of each column except the last. I can deal witth that later. Let's see if I can get the columns.

#+name: arrange-cols
#+begin_src lisp :results value

(let ((arr (cephalapod-parse *example*)))
(iter (for col below (array-dimension arr 1))
    (collect
       (iter (for row below (array-dimension arr 0))
          (collect (car (aref arr row col)))))))

#+end_src

#+RESULTS: arrange-cols
| 123 |  45 |   6 | * |
| 328 |  64 |  98 | + |
|  51 | 387 | 215 | * |
|  64 |  23 | 314 | + |

OK good. So each row contains the proper strings followed by the operator. I need to take those strings and process them character by character.

#+name: row2strings
#+begin_src lisp :results replace

(let ((arr (cephalapod-parse *example*)))
       (iter (for col below (array-dimension arr 1))
          (print (car (aref arr col 0)))))

#+end_src

#+RESULTS: row2strings
:
: "123 "
: " 45 "
: "  6 "
: "*   "

Yeah they line up nicely. I'm looking to turn that into (* 1 24 356) - so I'd  take char 0 of the first three, turn that into 1. char 1 of lines 0-2 turns into 24, char 2 of lines 0-2 is 356 and then char 0 of line 4 is *, the operand. I'm looking to write a function, PROCESS-COL, that does that for a single row. I'll start with the tests.

#+name: process-col
#+begin_src lisp :results replace
(sr:-> process-cols (list) number)
(defun process-cols (row)
  "Given a list of strings representing a row, with each number aligned with
spaces, and the last item representing an operator, return the result of
applying the operator to the digits formed by going from top to bottom column by
column."
  (let* ((operator-string (lastcar row))    ; last element of row is the op
         (digit-list (butlast row))         ; the list of number strings
         (cols (length (first digit-list))) ; length of each number string
         (numbers         ; list of the operands created by concatenating by col
           (iter (for c below cols)
             ;; collect the numbers by going down the columns
             (for digits =
                  (iter (for str in digit-list)
                    (collect (subseq str c (1+ c)) into pieces)
                    (finally (return (apply #'concatenate 'string pieces)))))
             (collect (parse-integer digits :junk-allowed t)))))

    (setf numbers (remove nil numbers)) ; the line of spaces at the end is nil
    (ecase (char operator-string 0)
      (#\+ (apply #'+ numbers))
      (#\* (apply #'* numbers)))))


(5a:test process-cols-test
  (5a:is (= (process-cols '("123 "
                            " 45 "
                            "  6 "
                            "*   ")) (* 1 24 356)))
  (5a:is (= (process-cols '("328 "
                            "64  "
                            "98  "
                            "+   ")) (+ 369 248 8)))
  (5a:is (= (process-cols '(" 51 "
                            "387 "
                            "215 "
                            "*   ")) (* 32 581 175)))
  (5a:is (= (process-cols '("64 "
                            "23 "
                            "314"
                            "+  ")) (+ 623 431 4))))

#+end_src

#+RESULTS: process-col
:
: Running test PROCESS-COLS-TEST ....
:  Did 4 checks.
:     Pass: 4 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)

Looking good. Now I just have to put it all together.

