2025/Day06/Day06.html
<div id="outline-container-orgd16ce68" class="outline-4">
<h4 id="orgd16ce68"><span class="section-number-4">1.4.1.</span> Cephalopod Parser</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-lisp" id="org923e257"><code>(sr:-&gt; cephalapod-parse (list) array)
(defun cephalapod-parse (input)
  "given a list of strings, return a 2D array with number strings grouped by column"
  (let ((rows (length input))       ; number of lines will be rows in arr
        (column-starts '())             ; indices into line for each column
        (operators (lastcar input)))    ; the operators are the last line

    ;; use the operators to determine column starts
    (iter (for i below (length operators))
      (when (not (char= #\space (char operators i))) ; it's an operand
        (push i column-starts))) ; save the location of the operand
    (setf column-starts (reverse column-starts))

    ;; now fill the 2d array GRID with numbers by column groups
    (let ((grid (make-array (list rows (length column-starts))
                            :element-type 'list
                            :initial-element nil)))
      (iter (for line in input)
        (for row :from 0)
        (iter (for (start . rest) on column-starts)
          (for group :from 0)
          (setf (aref grid row group)
                (push (subseq line start (first rest))
                      (aref grid row group)))))
      grid)))
</code></pre>
</div>

<p>
Let&rsquo;s see what that produces&hellip; BTW I&rsquo;ve changed my source template in the Emacs ORG-MODE.EL configuration to provide an automatic name for every source block using the current time. Just to keep things straight.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgae26253"><code>(format t "Example: ~%~a" (cephalapod-parse *example*))
</code></pre>
</div>

<pre class="example">
Example: 
#2A(((123 ) (328 ) ( 51 ) (64 ))
    (( 45 ) (64  ) (387 ) (23 ))
    ((  6 ) (98  ) (215 ) (314))
    ((*   ) (+   ) (*   ) (+  )))
</pre>

<p>
I see I am capturing the space at the end of each column except the last. I can deal witth that later. Let&rsquo;s see if I can get the columns.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org0cb406f"><code>
(let ((arr (cephalapod-parse *example*)))
(iter (for col below (array-dimension arr 1))
    (collect
       (iter (for row below (array-dimension arr 0))
          (collect (car (aref arr row col)))))))

</code></pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">123</td>
<td class="org-right">45</td>
<td class="org-right">6</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-right">328</td>
<td class="org-right">64</td>
<td class="org-right">98</td>
<td class="org-left">+</td>
</tr>

<tr>
<td class="org-right">51</td>
<td class="org-right">387</td>
<td class="org-right">215</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-right">64</td>
<td class="org-right">23</td>
<td class="org-right">314</td>
<td class="org-left">+</td>
</tr>
</tbody>
</table>

<p>
OK good. So each row contains the proper strings followed by the operator. I need to take those strings and process them character by character.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org2fd1729"><code>
(let ((arr (cephalapod-parse *example*)))
       (iter (for col below (array-dimension arr 1))
          (print (car (aref arr col 0)))))

</code></pre>
</div>

<pre class="example">

"123 " 
" 45 " 
"  6 " 
"*   " 
</pre>

<p>
Yeah they line up nicely. I&rsquo;m looking to turn that into (* 1 24 356) - so I&rsquo;d  take char 0 of the first three, turn that into 1. char 1 of lines 0-2 turns into 24, char 2 of lines 0-2 is 356 and then char 0 of line 4 is *, the operand. I&rsquo;m looking to write a function, PROCESS-COL, that does that for a single row. I&rsquo;ll start with the tests.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org6691571"><code>(sr:-&gt; process-cols (list) number)
(defun process-cols (row)
  "Given a list of strings representing a row, with each number aligned with
spaces, and the last item representing an operator, return the result of
applying the operator to the digits formed by going from top to bottom column by
column."
  (let* ((operator-string (lastcar row))    ; last element of row is the op
         (digit-list (butlast row))         ; the list of number strings
         (cols (length (first digit-list))) ; length of each number string
         (numbers         ; list of the operands created by concatenating by col
           (iter (for c below cols)
             ;; collect the numbers by going down the columns
             (for digits =
                  (iter (for str in digit-list)
                    (collect (subseq str c (1+ c)) into pieces)
                    (finally (return (apply #'concatenate 'string pieces)))))
             (collect (parse-integer digits :junk-allowed t)))))

    (setf numbers (remove nil numbers)) ; the line of spaces at the end is nil
    (ecase (char operator-string 0)
      (#\+ (apply #'+ numbers))
      (#\* (apply #'* numbers)))))


(5a:test process-cols-test
  (5a:is (= (process-cols '("123 "
                            " 45 "
                            "  6 "
                            "*   ")) (* 1 24 356)))
  (5a:is (= (process-cols '("328 "
                            "64  "
                            "98  "
                            "+   ")) (+ 369 248 8)))
  (5a:is (= (process-cols '(" 51 "
                            "387 "
                            "215 "
                            "*   ")) (* 32 581 175)))
  (5a:is (= (process-cols '("64 "
                            "23 "
                            "314"
                            "+  ")) (+ 623 431 4))))

</code></pre>
</div>

<pre class="example">

Running test PROCESS-COLS-TEST ....
 Did 4 checks.
    Pass: 4 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>

<p>
Looking good. Now I just have to put it all together.
</p>
</div>
</div>
