2025/Day06/Day06.org
*** Solution

#+begin_src lisp :results output
(sr:-> day06-2 (list) number)
(defun day06-2 (input)
  (let* ((grid (cephalapod-parse input)) ; make 2D array of input
         (column-list ; transpose it into a list of lists of strings
           (iter (for col below (array-dimension grid 1))
             (collect
                 (iter (for row below (array-dimension grid 0))
                   (collect (car (aref grid row col))))))))

    ;; process each number string by adding digits column by column
    (iter (for column in column-list)
      (summing (process-cols column)))))

(5a:test day06-2-test
  (5a:is (= 3263827 (day06-2 *example*))))
#+end_src

#+RESULTS:
:
: Running test DAY06-2-TEST .
:  Did 1 check.
:     Pass: 1 (100%)
:     Skip: 0 ( 0%)
:     Fail: 0 ( 0%)

Very nice the test passes. But I get an out-of-bounds error on the data. Ah I see the problem. When I transpose the array I'm using row col instead of col row - that makes it out of bounds. That worked because I accidentally swapped rows and cols in the iter clauses (which only worked in the *example* because it's a square - the data is most definitely not square!). Swapped the iter clauses  and used the proper  (aref arr row col) and it works again. All done. And it only took two days! At least the solution to part 2 took 0 seconds!

**  Solutions
#+name: Solutions
#+begin_src lisp :results replace
;; now solve the puzzle!
(time (format t "The answer to AOC 2025 Day 6 Part 1 is ~a~%"
              (day06-1 (uiop:read-file-lines *data-file*))))

 (time (format t "The answer to AOC 2025 Day 6 Part 2 is ~a~%"
 	      (day06-2 (uiop:read-file-lines *data-file*))))
#+end_src

#+RESULTS: Solutions
: The answer to AOC 2025 Day 6 Part 1 is 5873191732773
: The answer to AOC 2025 Day 6 Part 2 is 11386445308378

** Performance

Timings with SBCL on a 2023 MacBook Pro M3 Max with 64GB RAM and Tahoe 26.1

Evaluation took:
  0.002 seconds of real time
  0.002017 seconds of total run time (0.001854 user, 0.000163 system)
  100.00% CPU
  641,616 bytes consed

Evaluation took:
  0.000 seconds of real time
  0.000915 seconds of total run time (0.000859 user, 0.000056 system)
  100.00% CPU
  1,505,808 bytes consed
