2025/Day06/Day06.html
<div id="outline-container-orgefcedf6" class="outline-4">
<h4 id="orgefcedf6"><span class="section-number-4">1.4.2.</span> Solution</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-lisp"><code>(sr:-&gt; day06-2 (list) number)
(defun day06-2 (input)
  (let* ((grid (cephalapod-parse input)) ; make 2D array of input
         (column-list ; transpose it into a list of lists of strings
           (iter (for col below (array-dimension grid 1))
             (collect
                 (iter (for row below (array-dimension grid 0))
                   (collect (car (aref grid row col))))))))

    ;; process each number string by adding digits column by column
    (iter (for column in column-list)
      (summing (process-cols column)))))

(5a:test day06-2-test
  (5a:is (= 3263827 (day06-2 *example*))))
</code></pre>
</div>

<pre class="example">

Running test DAY06-2-TEST .
 Did 1 check.
    Pass: 1 (100%)
    Skip: 0 ( 0%)
    Fail: 0 ( 0%)
</pre>

<p>
Very nice the test passes. But I get an out-of-bounds error on the data. Ah I see the problem. When I transpose the array I&rsquo;m using row col instead of col row - that makes it out of bounds. That worked because I accidentally swapped rows and cols in the iter clauses (which only worked in the <b>example</b> because it&rsquo;s a square - the data is most definitely not square!). Swapped the iter clauses  and used the proper  (aref arr row col) and it works again. All done. And it only took two days! At least the solution to part 2 took 0 seconds!
</p>
</div>
</div>
</div>
<div id="outline-container-org1edf5c6" class="outline-3">
<h3 id="org1edf5c6"><span class="section-number-3">1.5.</span> Solutions</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-lisp" id="org81971b1"><code>;; now solve the puzzle!
(time (format t "The answer to AOC 2025 Day 6 Part 1 is ~a~%"
              (day06-1 (uiop:read-file-lines *data-file*))))

 (time (format t "The answer to AOC 2025 Day 6 Part 2 is ~a~%"
 	      (day06-2 (uiop:read-file-lines *data-file*))))
</code></pre>
</div>

<pre class="example">
The answer to AOC 2025 Day 6 Part 1 is 5873191732773
The answer to AOC 2025 Day 6 Part 2 is 11386445308378
</pre>
</div>
</div>
<div id="outline-container-orgdaaeca4" class="outline-3">
<h3 id="orgdaaeca4"><span class="section-number-3">1.6.</span> Performance</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Timings with SBCL on a 2023 MacBook Pro M3 Max with 64GB RAM and Tahoe 26.1
</p>

<p>
Evaluation took:
  0.002 seconds of real time
  0.002017 seconds of total run time (0.001854 user, 0.000163 system)
  100.00% CPU
  641,616 bytes consed
</p>

<p>
Evaluation took:
  0.000 seconds of real time
  0.000915 seconds of total run time (0.000859 user, 0.000056 system)
  100.00% CPU
  1,505,808 bytes consed
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Started Sat Dec 6 2025 11:15, Finished: Mon Dec  8 15:15:20 2025</p>
<p class="author">Author: Leo Laporte</p>
<p class="date">Created: 2025-12-08 Mon 15:33</p>
</div>
</body>
</html>
